---
kind: other
id: Methods.T:Autodesk.Revit.DB.ToposolidType
source: html/258ca636-1649-ef3c-dc95-283af0b5b3bf.htm
---
# ToposolidType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.